apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_lpi2c.c
/* I2C Device Private Data */

struct s32k1xx_lpi2c_priv_s
{
  /* Standard I2C operations */

  const struct i2c_ops_s *ops;

  /* Port configuration */

  const struct s32k1xx_lpi2c_config_s *config;

  int refs;                    /* Reference count */
  mutex_t lock;                /* Mutual exclusion mutex */
#ifndef CONFIG_I2C_POLLED
  sem_t sem_isr;               /* Interrupt wait semaphore */
#endif
  volatile uint8_t intstate;   /* Interrupt handshake (see enum s32k1xx_intstate_e) */

  uint8_t msgc;                /* Message count */
  struct i2c_msg_s *msgv;      /* Message list */
  uint8_t *ptr;                /* Current message buffer */
  uint32_t frequency;          /* Current I2C frequency */
  int dcnt;                    /* Current message length */
  uint16_t flags;              /* Current message flags */

  /* I2C trace support */

#ifdef CONFIG_I2C_TRACE
  int tndx;                    /* Trace array index */
  clock_t start_time;          /* Time when the trace was started */

  /* The actual trace data */

  struct s32k1xx_trace_s trace[CONFIG_I2C_NTRACE];
#endif

#ifdef CONFIG_S32K1XX_LPI2C_DMA
  DMACH_HANDLE rxdma;                                  /* rx DMA handle */
  DMACH_HANDLE txdma;                                  /* tx DMA handle */
  uint16_t     cmnds[CONFIG_S32K1XX_LPI2C_DMA_MAXMSG]; /* Commands */
#endif
  uint32_t status;             /* End of transfer SR2|SR1 status */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t
s32k1xx_lpi2c_getreg(struct s32k1xx_lpi2c_priv_s *priv,
                     uint16_t offset);
static inline void
s32k1xx_lpi2c_putreg(struct s32k1xx_lpi2c_priv_s *priv,
                     uint16_t offset, uint32_t value);
static inline void
s32k1xx_lpi2c_modifyreg(struct s32k1xx_lpi2c_priv_s *priv,
                        uint16_t offset, uint32_t clearbits,
                        uint32_t setbits);

#ifdef CONFIG_S32K1XX_LPI2C_DYNTIMEO
static uint32_t
s32k1xx_lpi2c_toticks(int msgc, struct i2c_msg_s *msgs);
#endif /* CONFIG_S32K1XX_LPI2C_DYNTIMEO */

static inline int
s32k1xx_lpi2c_sem_waitdone(struct s32k1xx_lpi2c_priv_s *priv);

#ifdef CONFIG_I2C_TRACE
static void s32k1xx_lpi2c_tracereset(struct s32k1xx_lpi2c_priv_s *priv);
static void s32k1xx_lpi2c_tracenew(struct s32k1xx_lpi2c_priv_s *priv,
                                   uint32_t status);
static void s32k1xx_lpi2c_traceevent(struct s32k1xx_lpi2c_priv_s *priv,
                                     enum s32k1xx_trace_e event,
                                     uint32_t parm);
static void s32k1xx_lpi2c_tracedump(struct s32k1xx_lpi2c_priv_s *priv);
#endif /* CONFIG_I2C_TRACE */

static uint32_t s32k1xx_lpi2c_pckfreq(uintptr_t base);
static void s32k1xx_lpi2c_setclock(struct s32k1xx_lpi2c_priv_s *priv,
                                   uint32_t frequency);
static inline void
s32k1xx_lpi2c_sendstart(struct s32k1xx_lpi2c_priv_s *priv,
                        uint8_t address);
static inline void
s32k1xx_lpi2c_sendstop(struct s32k1xx_lpi2c_priv_s *priv);
static inline uint32_t
s32k1xx_lpi2c_getstatus(struct s32k1xx_lpi2c_priv_s *priv);

static int s32k1xx_lpi2c_isr_process(struct s32k1xx_lpi2c_priv_s *priv);

#ifndef CONFIG_I2C_POLLED
static int s32k1xx_lpi2c_isr(int irq, void *context, void *arg);
#endif /* !CONFIG_I2C_POLLED */

static int s32k1xx_lpi2c_init(struct s32k1xx_lpi2c_priv_s *priv);
static int s32k1xx_lpi2c_deinit(struct s32k1xx_lpi2c_priv_s *priv);
static int s32k1xx_lpi2c_transfer(struct i2c_master_s *dev,
                                  struct i2c_msg_s *msgs, int count);
#ifdef CONFIG_I2C_RESET
static int s32k1xx_lpi2c_reset(struct i2c_master_s *dev);
#endif

#ifdef CONFIG_S32K1XX_LPI2C_DMA
static void s32k1xx_rxdma_callback(DMACH_HANDLE handle, void *arg, bool done,
                                  int result);
static void s32k1xx_txdma_callback(DMACH_HANDLE handle, void *arg, bool done,
                                  int result);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Trace events strings */

#ifdef CONFIG_I2C_TRACE
static const char *g_trace_names[] =
{
  "NONE           ",
  "SENDADDR       ",
  "SENDBYTE       ",
  "RCVBYTE        ",
  "NOSTART        ",
  "START/RESTART  ",
  "STOP           ",
  "ERROR          "
};
#endif

/* I2C interface */

static const struct i2c_ops_s s32k1xx_lpi2c_ops =
{
  .transfer = s32k1xx_lpi2c_transfer,
#ifdef CONFIG_I2C_RESET
  .reset  = s32k1xx_lpi2c_reset,
#endif
};

/* I2C device structures */

#ifdef CONFIG_S32K1XX_LPI2C0
static const struct s32k1xx_lpi2c_config_s s32k1xx_lpi2c0_config =
{
  .base       = S32K1XX_LPI2C0_BASE,
  .busy_idle  = CONFIG_LPI2C0_BUSYIDLE,
  .filtscl    = CONFIG_LPI2C0_FILTSCL,
  .filtsda    = CONFIG_LPI2C0_FILTSDA,
  .scl_pin    = PIN_LPI2C0_SCL,
  .sda_pin    = PIN_LPI2C0_SDA,
  .mode       = LPI2C_MASTER,
#ifndef CONFIG_I2C_POLLED
  .irq        = S32K1XX_IRQ_LPI2C0M,
#endif
#ifdef CONFIG_LPI2C0_DMA
  .dma_rxreqsrc    = S32K1XX_DMACHAN_LPI2C0_RX,
  .dma_txreqsrc    = S32K1XX_DMACHAN_LPI2C0_TX,
#endif
};

static struct s32k1xx_lpi2c_priv_s s32k1xx_lpi2c0_priv =
{
  .ops        = &s32k1xx_lpi2c_ops,
  .config     = &s32k1xx_lpi2c0_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .intstate   = INTSTATE_IDLE,
  .msgc       = 0,
  .msgv       = NULL,
  .ptr        = NULL,
  .dcnt       = 0,
  .flags      = 0,
  .status     = 0,
};
#endif /* CONFIG_S32K1XX_LPI2C0 */

#ifdef CONFIG_S32K1XX_LPI2C1
static const struct s32k1xx_lpi2c_config_s s32k1xx_lpi2c1_config =
{
  .base       = S32K1XX_LPI2C1_BASE,
  .busy_idle  = CONFIG_LPI2C1_BUSYIDLE,
  .filtscl    = CONFIG_LPI2C1_FILTSCL,
  .filtsda    = CONFIG_LPI2C1_FILTSDA,
  .scl_pin    = PIN_LPI2C1_SCL,
  .sda_pin    = PIN_LPI2C1_SDA,
  .mode       = LPI2C_MASTER,
#ifndef CONFIG_I2C_POLLED
  .irq        = S32K1XX_IRQ_LPI2C1M,
#endif
#ifdef CONFIG_LPI2C1_DMA
  .dma_rxreqsrc    = S32K1XX_DMACHAN_LPI2C1_RX,
  .dma_txreqsrc    = S32K1XX_DMACHAN_LPI2C1_TX,
#endif
};

